//发布状态
var publishStatusArray = ["求职中", "休假中", "已上船"];
//证书类型/等级
var certificateTypeArray = ["甲类", "乙一", "乙二", "丙一", "丙二", "丁类", "长一", "长二", "内河", "其他"];
//航线区域
var lineAreaArray = ["国内南北线", "中日韩", "东南亚", "中东波斯湾", "地中海", "南北美", "环球航线", "内河航线", "江海航线", "长江航线", "其他"];
//船舶类型选项
var shipTypeArray = [{
    "name" : "客船类",
    "sub" : [{
        "name" : "普通客船"
    }, {
        "name" : "客货船"
    }, {
        "name" : "客渡船"
    }, {
        "name" : "车客渡船"
    }, {
        "name" : "旅游客船"
    }, {
        "name" : "高速客船"
    }, {
        "name" : "客箱船"
    }, {
        "name" : "火车渡船（客）"
    }, {
        "name" : "地效翼船"
    }, {
        "name" : "高速客滚船"
    }]
}, {
    "name" : "普通货船类",
    "sub" : [{
        "name" : "干货船"
    }, {
        "name" : "杂货船"
    }, {
        "name" : "散货船"
    }, {
        "name" : "散装水泥运输船"
    }, {
        "name" : "集装箱船"
    }, {
        "name" : "滚装船"
    }, {
        "name" : "多用途船"
    }, {
        "name" : "木材船"
    }, {
        "name" : "水产品运输船"
    }, {
        "name" : "重大件运输船"
    }, {
        "name" : "驳船"
    }, {
        "name" : "汽车渡船"
    }, {
        "name" : "挂桨机船"
    }, {
        "name" : "冷藏船"
    }, {
        "name" : "火车渡船"
    }, {
        "name" : "矿/散/油船"
    }, {
        "name" : "半潜船"
    }]
}, {
    "name" : "液货船类",
    "sub" : [{
        "name" : "油船"
    }, {
        "name" : "散装化学品船"
    }, {
        "name" : "散装化学品船/油船"
    }, {
        "name" : "液化气船"
    }, {
        "name" : "散装沥青船"
    }, {
        "name" : "油驳"
    }, {
        "name" : "一般液货船"
    }]
}, {
    "name" : "工程船类",
    "sub" : [{
        "name" : "工程船"
    }, {
        "name" : "测量船"
    }, {
        "name" : "采沙船"
    }, {
        "name" : "挖泥船"
    }, {
        "name" : "疏浚船"
    }, {
        "name" : "打捞船"
    }, {
        "name" : "打桩船"
    }, {
        "name" : "超重船"
    }, {
        "name" : "搅拌船"
    }, {
        "name" : "布缆船"
    }, {
        "name" : "钻井船"
    }, {
        "name" : "打桩起重船"
    }, {
        "name" : "吹泥船"
    }, {
        "name" : "起重驳"
    }]
}, {
    "name" : "工作船类",
    "sub" : [{
        "name" : "工作船"
    }, {
        "name" : "破冰船"
    }, {
        "name" : "航标船"
    }, {
        "name" : "油污水处理船"
    }, {
        "name" : "供给船"
    }, {
        "name" : "垃圾处理船"
    }, {
        "name" : "拖船类"
    }, {
        "name" : "拖船"
    }, {
        "name" : "拖轮"
    }]
}, {
    "name" : "其它类",
    "sub" : [{
        "name" : "交通艇"
    }, {
        "name" : "引航船"
    }, {
        "name" : "求助船"
    }, {
        "name" : "浮船坞"
    }, {
        "name" : "公务船"
    }, {
        "name" : "摩托艇"
    }, {
        "name" : "帆船"
    }, {
        "name" : "趸船"
    }, {
        "name" : "游艇"
    }, {
        "name" : "特种用途船"
    }, {
        "name" : "水上平台"
    }, {
        "name" : "水下观光船"
    }, {
        "name" : "科学调查船"
    }, {
        "name" : "勘探船"
    }, {
        "name" : "渔船"
    }]
}];
//职位类型
var positionArray = ["整套班子", "船长", "大副", "二副", "三副", "白皮三副", "驾助", "实习三副", "GMDSS普通操作员", "水手长", "木匠", "水手", "二水", "新证水手", "实习水手", "轮机长", "大管轮", "二管轮", "三管轮", "白皮三管", "电机员", "电工", "轮助", "实习三管", "机工长", "铜匠", "泵匠", "机工", "新证机工", "实习机工", "大厨", "服务员", "船医", "其他"];
//机构许可类型
var jgxklx = ["", "", "甲级服务机构", "乙级服务机构", "内河服务机构", "海员外派机构"];
